In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("salaries.csv")

In [4]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [5]:
inputs=df.drop(labels="salary_more_then_100k",axis=1)

In [6]:
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [17]:
inputs.columns

Index(['company', 'job', 'degree'], dtype='object')

In [47]:
target=df["salary_more_then_100k"]

In [14]:
from sklearn.preprocessing import LabelEncoder

In [25]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()
inputs["new_company"]=le_company.fit_transform(inputs["company"])
inputs["new_job"]=le_job.fit_transform(inputs["job"])
inputs["new_degree"]=le_degree.fit_transform(inputs["degree"])

In [34]:
inp=inputs.drop(labels=["company","job","degree"],axis=1)

In [41]:
inp

    new_company  new_job  new_degree
0             2        2           0
1             2        2           1
2             2        0           0
3             2        0           1
4             2        1           0
5             2        1           1
6             0        2           1
7             0        1           0
8             0        0           0
9             0        0           1
10            1        2           0
11            1        2           1
12            1        0           0
13            1        0           1
14            1        1           0
15            1        1           1

In [35]:
from sklearn import tree

In [43]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [36]:
model=tree.DecisionTreeClassifier()

In [37]:
model.fit(inp,target)

DecisionTreeClassifier()

In [39]:
model.score(inp,target)

1.0

In [54]:
model.predict([[1,2,1]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)